//
//  imageQuestionData.swift
//  QuizeGame
//
//  Created by punyawee  on 30/4/61.
//  Copyright © พ.ศ. 2561 punyawee . All rights reserved.
//

import Foundation

class QuestionData {
    class func getImageQuestions() -> [ImageQuestion] {
        return [
            ImageQuestion("กีฬาฟุตซอล", ["กีฬาฟุตบอล", "กีฬาบาส", "กีฬาวอลเล่ย์บอล", "กีฬาฟุตซอล"]),
            ImageQuestion("กีฬาฟุตบอล", ["กีฬาฟุตบอล", "กีฬาบาส", "กีฬาวอลเล่ย์บอล", "กีฬาฟุตซอล"]),
            ImageQuestion("ดวงอาทิตย์ขึ้น", ["ดวงอาทิตย์ขึ้น", "อากาศฝนตก", "น้ำท่วม", "น้ำตก"]),
            ImageQuestion("ตลาดสด", ["ห้างสรรพสินค้า", "ตลาดสด", "ตลาดน้ำ", "ขายของออนไลน์"]),
            ImageQuestion("ตำรวจ", ["ทหาร", "ตำรวจ", "ลูกเสือ", "รปภ."]),
            ImageQuestion("ทหาร", ["นายก", "ผู้ประกาศข่าว", "ทหาร", "นักแต่งเพลง"]),
            ImageQuestion("ทะเล", ["ทะเล", "ภูเขา", "น้ำตก", "บึง"]),
            ImageQuestion("นาเกลือ", ["นาข้าว", "สวนผัก", "สวนผลไม้", "นาเกลือ"]),
            ImageQuestion("นาข้าว", ["นาเกลือ", "สวนผัก", "สวนผลไม้", "นาข้าว"]),
            ImageQuestion("น้ำท่วม", ["ไฟไหม้", "น้ำท่วม", "อากาศแห้ง", "ฟ้าผ่า"]),
            ImageQuestion("ป่ากงกาง", ["ป่ากงกาง", "ป่าไม้", "ป่าดิบชื้น", "ป่าหญ้า"]),
            ImageQuestion("ป่าไม้", ["ป่ากงกาง", "ป่าไม้", "ป่าดิบชื้น", "ป่าหญ้า"]),
            ImageQuestion("พยาบาล", ["นางฟ้า", "ครู", "พยาบาล", "ตำรวจ"]),
            ImageQuestion("ภูเขา", ["ทะเล", "ภูเขา", "น้ำตก", "บึง"]),
            ImageQuestion("แม่น้ำ", ["ทะเล", "ภูเขา", "น้ำตก", "แม่น้ำ"]),
            ImageQuestion("แมว", ["นก", "แมว", "สุนัข", "ลิง"]),
            ImageQuestion("โรงเรียน", ["โรงเรียน", "โรงบาล", "โรงพัก", "โรงงาน"]),
            ImageQuestion("เสือดำ", ["เสือดำ", "เปรมชัย", "แมวน้ำ", "สิงโต"]),
            ImageQuestion("หมานอน", ["หมานั่ง", "หมานอน", "หมาหอน", "หมากระโดด"]),
            ImageQuestion("หมานั่ง", ["หมานั่ง", "หมานอน", "หมาหอน", "หมากระโดด"]),
            ImageQuestion("ตลาดสด", ["ห้างสรรพสินค้า", "ตลาดสด", "ตลาดน้ำ", "ขายของออนไลน์"])
        ]
    }
    class func getSoundQuestions() -> [SoundQuestion] {
        return [
            SoundQuestion("ค้างคาว", ["ค้างคาว", "สุนัข", "งู", "นก"])
        ]
    }
}
